## 2.3 Pandas

### Pandas
* https://pandas.pydata.org/
* Python Data Analysis Library
* R의 data.frame을 본 떠서 설계한 DataFrame 기반
* 고성능  NumPy 기반
* 간편한 데이타 구조 및 분석 도구
* SQL 처럼 테이블에 쿼리, 조인 수행
* 각 열의 타입이 다르거나 문자 허용
* NumPy + Dict
    * Record + Column
    * 2차원 관계형 DBMS 테이블 처럼 사용
    * Series, DataFrame
![](https://www.bedrockdata.com/hs-fs/hubfs/pandas-logo.png?width=263&name=pandas-logo.png)

### Module Import

In [1]:
import pandas as pd

### Series
* 일련의 객체를 담을 수 있는 1차원 배열 자료구조
* Index로 요소 접근

### 리스트로 시리즈 생성

In [8]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3])

### 리스트와 인덱스로 생성

In [12]:
obj2 = pd.Series([4,7,-5,3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
print(obj[2], obj2[2], obj2['a'])

-5 -5 -5

### DataFrame
* 엑셀 스프레드 시트 형식의 자료 구조
* 여러개의 컬럼
* row와 column에 대한 색인
    * 색인(Index)의 모양이 같은 Series를 담고 있는 파이썬 dictionary
* columns : 컬럼의 순서 지정

In [22]:
name = pd.Series(['Lee', 'Kim', 'Park'])
age = pd.Series([27,24,15])
friends = pd.DataFrame({'name':name, 'age': age}, columns=['name', 'age'])
friends

   name  age
0   Lee   27
1   Kim   24
2  Park   15

### 컬럼으로 접근

In [23]:
print(friends['name'], friends['age'])

0     Lee
1     Kim
2    Park
Name: name, dtype: object 0    27
1    24
2    15
Name: age, dtype: int64

### 인덱스로 접근

In [24]:
friends.ix[0]

/Users/rainer/Dropbox/work/ml_dl/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name    Lee
age      27
Name: 0, dtype: object

In [25]:
friends.iloc[0]

name    Lee
age      27
Name: 0, dtype: object

```python
>>> friends['job'] = 'student'
>>> friends
	name	age	job
0	Lee	27	student
1	Kim	24	student
2	Park	15	student
>>> friends.loc[friends['age'] > 19]
>>> friends
	name	age	job	adult
0	Lee	27	student	True
1	Kim	24	student	True
2	Park	15	student	False
```

### 컬럼 추가

In [26]:
friends['job'] = 'student'
friends

   name  age      job
0   Lee   27  student
1   Kim   24  student
2  Park   15  student

### 연산과 함께 컬럼 추가

In [27]:
friends['adult'] = friends['age'] > 19

In [28]:
friends

   name  age      job  adult
0   Lee   27  student   True
1   Kim   24  student   True
2  Park   15  student  False

In [32]:
friends.loc[friends['age'] > 19]

  name  age      job  adult
0  Lee   27  student   True
1  Kim   24  student   True